# -*- coding: UTF-8 -*-
import json

# input_data = [{'year': 2014, 'value': [{'type': '充分性', 'index': [{'name': '公司年报是否披露主要的财务指标', 'grade': 0.49637091861336435, 'is_check': 1}, {'name': '公司年报是否披露其他应收、应付款等带"其他"字样的项目的详细情况', 'grade': 0.5608096218102105, 'is_check': 0}, {'name': '公司是否披露营业外收支的详细情况', 'grade': 0.6738707603461028, 'is_check': 1}, {'name': '公司是否披露披露募集资金有关项目的进展', 'grade': 0.5456946191581636, 'is_check': 1}, {'name': '投资项目未达到计划进度和收益的，公司是否披露原因', 'grade': 0.26204752904224976, 'is_check': 1}, {'name': '公司募集资金投资项目变更的是否披露变更原因', 'grade': 0.2712815555281308, 'is_check': 1}, {'name': '公司年报是否说明关联交易的必要性、持续性', 'grade': 0.23564803980736782, 'is_check': 1}, {'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明', 'grade': 0.8855409189918058, 'is_check': 1}, {'name': '公司是否披露支付的审计费用金额', 'grade': 0.3698224852071006, 'is_check': 1}, {'name': '若不存在任何重大担保合同，公司是否在年报中声明', 'grade': 0.08978687843569158, 'is_check': 1}, {'name': '公司年报是否披露更换会计事务所的原因', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否披露社会责任报告书', 'grade': 0.5006494526042337, 'is_check': 1}, {'name': '公司年报中是否披露重要的会计政策', 'grade': 0.5406661308148297, 'is_check': 1}]}, {'type': '准时性', 'index': [{'name': '公司第一季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否一个月内披露', 'grade': 0, 'is_check': 0}, {'name': '公司第三季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在法定时间披露', 'grade': 0, 'is_check': 0}, {'name': '年报是否在会计年度结束后两个月内披露', 'grade': 0, 'is_check': 0}, {'name': '是否及时披露董事会、监事会和股东大会的决议报告', 'grade': 0.42984229883288044, 'is_check': 1}]}, {'type': '真实性', 'index': [{'name': '证监会对于信息披露不按期行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '证监会对于信息披露不真实行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见', 'grade': 1, 'is_check': 1}, {'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量。', 'grade': 0.0, 'is_check': 0}, {'name': '是否有独立董事', 'grade': 0.3152642048110744, 'is_check': 1}, {'name': '是否有审计委员会', 'grade': 0.569109357384442, 'is_check': 1}, {'name': '公司是否披露内部控制', 'grade': 0.45034795084540624, 'is_check': 0}, {'name': '公司是否披露经审核有效的内部控制鉴证报告', 'grade': 0.9985615423499532, 'is_check': 1}]}, {'type': '相关性', 'index': [{'name': '公司是否根据风险情况，披露拟采取的对策', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否自愿披露经审核的新年度盈利预测', 'grade': 0.9281889499905387, 'is_check': 1}, {'name': '公司年报是否披露新年度的经营计划或经营目标', 'grade': 0.35348655161025966, 'is_check': 1}, {'name': '公司是否对公司战略进行描述', 'grade': 0.4442250740375123, 'is_check': 1}, {'name': '公司是否进行行业未来的发展趋势分析', 'grade': 0.4160125588697017, 'is_check': 1}, {'name': '公司是否对面临的市场竞争格局进行分析', 'grade': 0.4975932370246572, 'is_check': 1}, {'name': '公司是否对未来公司发展机遇和挑战进行分析', 'grade': 0.3300850145489953, 'is_check': 1}, {'name': '公司是否对面临的风险因素进行分析', 'grade': 0.5748110081778501, 'is_check': 1}]}, {'type': '其他', 'index': [{'name': '是否未发生会计变更', 'grade': 0.0, 'is_check': 0}, {'name': '是否披露发生会计变更原因', 'grade': 0.0, 'is_check': 0}, {'name': '年报中是否披露公司建有网站', 'grade': 0.531527850989114, 'is_check': 1}]}]}, {'year': 2015, 'value': [{'type': '充分性', 'index': [{'name': '公司年报是否披露主要的财务指标', 'grade': 0.5291113871787647, 'is_check': 0}, {'name': '公司年报是否披露其他应收、应付款等带"其他"字样的项目的详细情况', 'grade': 0.6446344150963645, 'is_check': 1}, {'name': '公司是否披露营业外收支的详细情况', 'grade': 0.8904371048751577, 'is_check': 1}, {'name': '公司是否披露披露募集资金有关项目的进展', 'grade': 0.46697758895697206, 'is_check': 1}, {'name': '投资项目未达到计划进度和收益的，公司是否披露原因', 'grade': 0.5133642455222329, 'is_check': 1}, {'name': '公司募集资金投资项目变更的是否披露变更原因', 'grade': 0.8855087964677006, 'is_check': 1}, {'name': '公司年报是否说明关联交易的必要性、持续性', 'grade': 0.5105707529159635, 'is_check': 1}, {'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明', 'grade': 0.7511323168412682, 'is_check': 1}, {'name': '公司是否披露支付的审计费用金额', 'grade': 0.665680473372781, 'is_check': 1}, {'name': '若不存在任何重大担保合同，公司是否在年报中声明', 'grade': 0.15717232317962687, 'is_check': 1}, {'name': '公司年报是否披露更换会计事务所的原因', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否披露社会责任报告书', 'grade': 0.759716810117187, 'is_check': 1}, {'name': '公司年报中是否披露重要的会计政策', 'grade': 0.3168014668944037, 'is_check': 1}]}, {'type': '准时性', 'index': [{'name': '公司第一季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否一个月内披露', 'grade': 0, 'is_check': 0}, {'name': '公司第三季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在会计年度结束后两个月内披露', 'grade': 0, 'is_check': 0}, {'name': '是否及时披露董事会、监事会和股东大会的决议报告', 'grade': 0.3433561661754068, 'is_check': 1}]}, {'type': '真实性', 'index': [{'name': '证监会对于信息披露不按期行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '证监会对于信息披露不真实行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见', 'grade': 1, 'is_check': 1}, {'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量。', 'grade': 0.0, 'is_check': 0}, {'name': '是否有独立董事', 'grade': 0.3399309364436186, 'is_check': 1}, {'name': '是否有审计委员会', 'grade': 0.07818489289740699, 'is_check': 1}, {'name': '公司是否披露内部控制', 'grade': 0.4144689886264799, 'is_check': 0}, {'name': '公司是否披露经审核有效的内部控制鉴证报告', 'grade': 0.0, 'is_check': 0}]}, {'type': '相关性', 'index': [{'name': '公司是否根据风险情况，披露拟采取的对策', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否自愿披露经审核的新年度盈利预测', 'grade': 0.8422782970695764, 'is_check': 1}, {'name': '公司年报是否披露新年度的经营计划或经营目标', 'grade': 0.2522719767114742, 'is_check': 1}, {'name': '公司是否对公司战略进行描述', 'grade': 0.3948667324777887, 'is_check': 1}, {'name': '公司是否进行行业未来的发展趋势分析', 'grade': 0.2943485086342229, 'is_check': 1}, {'name': '公司是否对面临的市场竞争格局进行分析', 'grade': 0.4975932370246572, 'is_check': 1}, {'name': '公司是否对未来公司发展机遇和挑战进行分析', 'grade': 0.36074127053212646, 'is_check': 1}, {'name': '公司是否对面临的风险因素进行分析', 'grade': 0.5748110081778501, 'is_check': 1}]}, {'type': '其他', 'index': [{'name': '是否未发生会计变更', 'grade': 0.0, 'is_check': 0}, {'name': '是否披露发生会计变更原因', 'grade': 0.0, 'is_check': 0}, {'name': '年报中是否披露公司建有网站', 'grade': 0.5090552146806886, 'is_check': 1}]}]}, {'year': 2016, 'value': [{'type': '充分性', 'index': [{'name': '公司年报是否披露主要的财务指标', 'grade': 0.35171413829391623, 'is_check': 0}, {'name': '公司年报是否披露其他应收、应付款等带"其他"字样的项目的详细情况', 'grade': 0.4815282030360648, 'is_check': 0}, {'name': '公司是否披露营业外收支的详细情况', 'grade': 1, 'is_check': 1}, {'name': '公司是否披露披露募集资金有关项目的进展', 'grade': 0.44841970523054897, 'is_check': 1}, {'name': '投资项目未达到计划进度和收益的，公司是否披露原因', 'grade': 0.2731701753242521, 'is_check': 1}, {'name': '公司募集资金投资项目变更的是否披露变更原因', 'grade': 0.5490593333059086, 'is_check': 1}, {'name': '公司年报是否说明关联交易的必要性、持续性', 'grade': 0.4550766094764198, 'is_check': 1}, {'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明', 'grade': 0.5831215641530961, 'is_check': 1}, {'name': '公司是否披露支付的审计费用金额', 'grade': 0.3698224852071006, 'is_check': 1}, {'name': '若不存在任何重大担保合同，公司是否在年报中声明', 'grade': 0.13458974581920413, 'is_check': 1}, {'name': '公司年报是否披露更换会计事务所的原因', 'grade': 1, 'is_check': 1}, {'name': '公司是否披露社会责任报告书', 'grade': 0.8799725945274697, 'is_check': 1}, {'name': '公司年报中是否披露重要的会计政策', 'grade': 0.5321887873003115, 'is_check': 1}]}, {'type': '准时性', 'index': [{'name': '公司第一季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否一个月内披露', 'grade': 0, 'is_check': 0}, {'name': '公司第三季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在会计年度结束后两个月内披露', 'grade': 0, 'is_check': 0}, {'name': '是否及时披露董事会、监事会和股东大会的决议报告', 'grade': 0.5266120754526304, 'is_check': 1}]}, {'type': '真实性', 'index': [{'name': '证监会对于信息披露不按期行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '证监会对于信息披露不真实行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见', 'grade': 1, 'is_check': 1}, {'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量。', 'grade': 0.0, 'is_check': 0}, {'name': '是否有独立董事', 'grade': 0.49708361371815957, 'is_check': 1}, {'name': '是否有审计委员会', 'grade': 0.3036640360766629, 'is_check': 1}, {'name': '公司是否披露内部控制', 'grade': 0.2180927841857593, 'is_check': 0}, {'name': '公司是否披露经审核有效的内部控制鉴证报告', 'grade': 0.0, 'is_check': 0}]}, {'type': '相关性', 'index': [{'name': '公司是否根据风险情况，披露拟采取的对策', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否自愿披露经审核的新年度盈利预测', 'grade': 1, 'is_check': 1}, {'name': '公司年报是否披露新年度的经营计划或经营目标', 'grade': 0.17674327580512983, 'is_check': 1}, {'name': '公司是否对公司战略进行描述', 'grade': 0.5429417571569595, 'is_check': 1}, {'name': '公司是否进行行业未来的发展趋势分析', 'grade': 0.2688383045525902, 'is_check': 1}, {'name': '公司是否对面临的市场竞争格局进行分析', 'grade': 1, 'is_check': 1}, {'name': '公司是否对未来公司发展机遇和挑战进行分析', 'grade': 0.7602624220761243, 'is_check': 1}, {'name': '公司是否对面临的风险因素进行分析', 'grade': 0.5748110081778501, 'is_check': 1}]}, {'type': '其他', 'index': [{'name': '是否未发生会计变更', 'grade': 0.0, 'is_check': 0}, {'name': '是否披露发生会计变更原因', 'grade': 0.7490487743440851, 'is_check': 1}, {'name': '年报中是否披露公司建有网站', 'grade': 0.6259422615826172, 'is_check': 1}]}]}, {'year': 2017, 'value': [{'type': '充分性', 'index': [{'name': '公司年报是否披露主要的财务指标', 'grade': 0.37000405139850795, 'is_check': 0}, {'name': '公司年报是否披露其他应收、应付款等带"其他"字样的项目的详细情况', 'grade': 0.6186694345824643, 'is_check': 0}, {'name': '公司是否披露营业外收支的详细情况', 'grade': 1, 'is_check': 1}, {'name': '公司是否披露披露募集资金有关项目的进展', 'grade': 0.44841970523054897, 'is_check': 1}, {'name': '投资项目未达到计划进度和收益的，公司是否披露原因', 'grade': 0.4356453850522807, 'is_check': 1}, {'name': '公司募集资金投资项目变更的是否披露变更原因', 'grade': 0.0, 'is_check': 0}, {'name': '公司年报是否说明关联交易的必要性、持续性', 'grade': 0.4550766094764198, 'is_check': 1}, {'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明', 'grade': 0.6167237146907305, 'is_check': 1}, {'name': '公司是否披露支付的审计费用金额', 'grade': 0.5177514792899408, 'is_check': 1}, {'name': '若不存在任何重大担保合同，公司是否在年报中声明', 'grade': 0.42671410215536815, 'is_check': 1}, {'name': '公司年报是否披露更换会计事务所的原因', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否披露社会责任报告书', 'grade': 0.0, 'is_check': 0}, {'name': '公司年报中是否披露重要的会计政策', 'grade': 0.5701798452727821, 'is_check': 1}]}, {'type': '准时性', 'index': [{'name': '公司第一季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否一个月内披露', 'grade': 0, 'is_check': 0}, {'name': '公司第三季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在会计年度结束后两个月内披露', 'grade': 0, 'is_check': 0}, {'name': '是否及时披露董事会、监事会和股东大会的决议报告', 'grade': 0.1928916218387488, 'is_check': 1}]}, {'type': '真实性', 'index': [{'name': '证监会对于信息披露不按期行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '证监会对于信息披露不真实行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见', 'grade': 1, 'is_check': 1}, {'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量。', 'grade': 0.0, 'is_check': 0}, {'name': '是否有独立董事', 'grade': 0.40181587309530364, 'is_check': 1}, {'name': '是否有审计委员会', 'grade': 0.3036640360766629, 'is_check': 1}, {'name': '公司是否披露内部控制', 'grade': 0.3875923574867898, 'is_check': 0}, {'name': '公司是否披露经审核有效的内部控制鉴证报告', 'grade': 0.0, 'is_check': 0}]}, {'type': '相关性', 'index': [{'name': '公司是否根据风险情况，披露拟采取的对策', 'grade': 1, 'is_check': 1}, {'name': '公司是否自愿披露经审核的新年度盈利预测', 'grade': 0.3609764130298185, 'is_check': 1}, {'name': '公司年报是否披露新年度的经营计划或经营目标', 'grade': 0.5302298274153895, 'is_check': 1}, {'name': '公司是否对公司战略进行描述', 'grade': 0.3455083909180651, 'is_check': 1}, {'name': '公司是否进行行业未来的发展趋势分析', 'grade': 0.2943485086342229, 'is_check': 1}, {'name': '公司是否对面临的市场竞争格局进行分析', 'grade': 0.7850955264543602, 'is_check': 1}, {'name': '公司是否对未来公司发展机遇和挑战进行分析', 'grade': 0.36116548071639487, 'is_check': 1}, {'name': '公司是否对面临的风险因素进行分析', 'grade': 0.82995357892882, 'is_check': 1}]}, {'type': '其他', 'index': [{'name': '是否未发生会计变更', 'grade': 0.0, 'is_check': 0}, {'name': '是否披露发生会计变更原因', 'grade': 0.47030982778506936, 'is_check': 1}, {'name': '年报中是否披露公司建有网站', 'grade': 0.6230544274676897, 'is_check': 1}]}]}, {'year': 2018, 'value': [{'type': '充分性', 'index': [{'name': '公司年报是否披露主要的财务指标', 'grade': 0.44741831114660785, 'is_check': 0}, {'name': '公司年报是否披露其他应收、应付款等带"其他"字样的项目的详细情况', 'grade': 0.42396010978070187, 'is_check': 0}, {'name': '公司是否披露营业外收支的详细情况', 'grade': 1, 'is_check': 1}, {'name': '公司是否披露披露募集资金有关项目的进展', 'grade': 0.44841970523054897, 'is_check': 1}, {'name': '投资项目未达到计划进度和收益的，公司是否披露原因', 'grade': 0.25582862356961295, 'is_check': 1}, {'name': '公司募集资金投资项目变更的是否披露变更原因', 'grade': 0.3854368066696834, 'is_check': 1}, {'name': '公司年报是否说明关联交易的必要性、持续性', 'grade': 0.5105707529159635, 'is_check': 1}, {'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明', 'grade': 0.6167237146907305, 'is_check': 1}, {'name': '公司是否披露支付的审计费用金额', 'grade': 0.5177514792899408, 'is_check': 1}, {'name': '若不存在任何重大担保合同，公司是否在年报中声明', 'grade': 0.08978687843569158, 'is_check': 1}, {'name': '公司年报是否披露更换会计事务所的原因', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否披露社会责任报告书', 'grade': 0.24158209509128023, 'is_check': 1}, {'name': '公司年报中是否披露重要的会计政策', 'grade': 0.5701798452727821, 'is_check': 1}]}, {'type': '准时性', 'index': [{'name': '公司第一季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '公司中报是否按法定时间披露', 'grade': 2, 'is_check': 2}, {'name': '公司中报是否一个月内披露', 'grade': 2, 'is_check': 2}, {'name': '公司第三季报是否按法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在法定时间披露', 'grade': 1, 'is_check': 1}, {'name': '年报是否在会计年度结束后两个月内披露', 'grade': 0, 'is_check': 0}, {'name': '是否及时披露董事会、监事会和股东大会的决议报告', 'grade': 0.378209455683845, 'is_check': 1}]}, {'type': '真实性', 'index': [{'name': '证监会对于信息披露不按期行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '证监会对于信息披露不真实行为给予公开谴责', 'grade': 1, 'is_check': 1}, {'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见', 'grade': 1, 'is_check': 1}, {'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量。', 'grade': 0.0, 'is_check': 0}, {'name': '是否有独立董事', 'grade': 0.41680768212722863, 'is_check': 1}, {'name': '是否有审计委员会', 'grade': 0.3036640360766629, 'is_check': 1}, {'name': '公司是否披露内部控制', 'grade': 0.5560417103572043, 'is_check': 0}, {'name': '公司是否披露经审核有效的内部控制鉴证报告', 'grade': 0.0, 'is_check': 0}]}, {'type': '相关性', 'index': [{'name': '公司是否根据风险情况，披露拟采取的对策', 'grade': 0.0, 'is_check': 0}, {'name': '公司是否自愿披露经审核的新年度盈利预测', 'grade': 0.3609764130298185, 'is_check': 1}, {'name': '公司年报是否披露新年度的经营计划或经营目标', 'grade': 0.4290152525166041, 'is_check': 1}, {'name': '公司是否对公司战略进行描述', 'grade': 0.3455083909180651, 'is_check': 1}, {'name': '公司是否进行行业未来的发展趋势分析', 'grade': 0.9468210361067504, 'is_check': 1}, {'name': '公司是否对面临的市场竞争格局进行分析', 'grade': 0.7524353808466311, 'is_check': 1}, {'name': '公司是否对未来公司发展机遇和挑战进行分析', 'grade': 0.29144653693188005, 'is_check': 1}, {'name': '公司是否对面临的风险因素进行分析', 'grade': 0.42185545628128795, 'is_check': 1}]}, {'type': '其他', 'index': [{'name': '是否未发生会计变更', 'grade': 0.0, 'is_check': 0}, {'name': '是否披露发生会计变更原因', 'grade': 0.5856500815336276, 'is_check': 1}, {'name': '年报中是否披露公司建有网站', 'grade': 0.627310471049576, 'is_check': 1}]}]}]

def ConvertData(input_raw_data):
    input_data=json.loads(input_raw_data)
    output_data = {
        'years': [],
        'total': [],
        'detail': [{
            'type': '充分性',
            'total': [],
            'index': [{
                'name': '公司年报是否披露主要的财务指标',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司年报是否披露其他应收、应付款等带\'其他\'字样的项目的详细情况',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露营业外收支的详细情况',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露披露募集资金有关项目的进展',
                'grade': [],
                'is_check': []
            }, {
                'name': '投资项目未达到计划进度和收益的，公司是否披露原因',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司募集资金投资项目变更的是否披露变更原因',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司年报是否说明关联交易的必要性、持续性',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司若不存在重大诉讼、仲裁事项，是否在年报中明确声明',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露支付的审计费用金额',
                'grade': [],
                'is_check': []
            }, {
                'name': '若不存在任何重大担保合同，公司是否在年报中声明',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司年报是否披露更换会计事务所的原因',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露社会责任报告书',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司年报中是否披露重要的会计政策',
                'grade': [],
                'is_check': []
            }]
        }, {
            'type': '准时性',
            'total': [],
            'index': [{
                'name': '公司第一季报是否按法定时间披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司中报是否按法定时间披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司中报是否一个月内披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司第三季报是否按法定时间披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '年报是否在法定时间披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '年报是否在会计年度结束后两个月内披露',
                'grade': [],
                'is_check': []
            }, {
                'name': '是否及时披露董事会、监事会和股东大会的决议报告',
                'grade': [],
                'is_check': []
            }]
        }, {
            'type': '真实性',
            'total': [],
            'index': [{
                'name': '证监会对于信息披露不按期行为给予公开谴责',
                'grade': [],
                'is_check': []
            }, {
                'name': '证监会对于信息披露不真实行为给予公开谴责',
                'grade': [],
                'is_check': []
            }, {
                'name': '注册会计师出具的审计报告体现了被审单位信息披露的质量，标准无保留意见',
                'grade': [],
                'is_check': []
            }, {
                'name': '两职分离能有效地提高监督和控制经理层的能力、维护董事会的独立性、保证会计信息披露质量',
                'grade': [],
                'is_check': []
            }, {
                'name': '是否有独立董事',
                'grade': [],
                'is_check': []
            }, {
                'name': '是否有审计委员会',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露内部控制',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否披露经审核有效的内部控制鉴证报告',
                'grade': [],
                'is_check': []
            }]
        }, {
            'type': '相关性',
            'total': [],
            'index': [{
                'name': '公司是否根据风险情况，披露拟采取的对策',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否自愿披露经审核的新年度盈利预测',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司年报是否披露新年度的经营计划或经营目标',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否对公司战略进行描述',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否进行行业未来的发展趋势分析',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否对面临的市场竞争格局进行分析',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否对未来公司发展机遇和挑战进行分析',
                'grade': [],
                'is_check': []
            }, {
                'name': '公司是否对面临的风险因素进行分析',
                'grade': [],
                'is_check': []
            }]
        }, {
            'type': '其他',
            'total': [],
            'index': [{
                'name': '是否未发生会计变更',
                'grade': [],
                'is_check': []
            }, {
                'name': '是否披露发生会计变更原因',
                'grade': [],
                'is_check': []
            }, {
                'name': '年报中是否披露公司建有网站',
                'grade': [],
                'is_check': []
            }]
        }]
    }

    for a_year_data in input_data:
        output_data['years'].append(a_year_data['year'])
        total = 0
        for i, a_type in enumerate(a_year_data['value']):
            a_type_total = 0
            for j, a_index in enumerate(a_type['index']):
                total += a_index['grade']
                a_type_total += a_index['grade']
                output_data['detail'][i]['index'][j]['grade'].append(a_index['grade'])
                output_data['detail'][i]['index'][j]['is_check'].append(a_index['is_check'])
            output_data['detail'][i]['total'].append(a_type_total)
        output_data['total'].append(total)

    print(json.dumps(output_data))
    return output_data

